
Switch>
Switch>en
Switch#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#name cctv
Switch(config-vlan)#int range f0/1-2                                        //Vlan Innititialization,Name & Port Declaration.
Switch(config-if-range)#switchport mode access                                 
Switch(config-if-range)#switchport access vlan 10
Switch(config-if-range)#ex

Switch(config-vlan)#vlan 20
Switch(config-vlan)#name ip_phon
Switch(config-vlan)#int range f0/3-4
Switch(config-if-range)#switchport mode access                             //Vlan Innititialization,Name & Port Declaration.
Switch(config-if-range)#switchport access vlan 20
Switch(config-if-range)#ex

Switch(config-vlan)#vlan 30
Switch(config-vlan)#name pis
Switch(config-vlan)#int range f0/5-6
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 30                          //Vlan Innititialization,Name & Port Declaration.
Switch(config-if-range)#ex

Switch(config-if)#switchport mode trunk
Switch(config-if)#
Switch(config-if)#ex
Switch(config)#ex
Switch#
%SYS-5-CONFIG_I: Configured from console by console
Switch#                                                                      //TRUNK PORT DECLARATION & WRITING CONFIG IN FLASH.
Switch#wr
Building configuration...
[OK]
Switch#




////////////Routr config/////////////////


Router>
Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int g0/0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
	
Router(config-if)#int g0/0.10
Router(config-subif)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0.10, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.10, changed state to up


Router(config-subif)#encapsulation dot1q 10
Router(config-subif)#ip address 172.16.32.1 255.255.252.0
Router(config-subif)#ex
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#wr
Building configuration...
[OK]
Router#
Router(config)#int g0/0.20
Router(config-subif)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0.20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.20, changed state to up

Router(config-subif)#encapsulation dot1q 20
Router(config-subif)#ip address 172.16.10.1 255.255.252.0
Router(config-subif)#int g0/0.30
Router(config-subif)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0.30, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.30, changed state to up

Router(config-subif)#encapsulation dot1q 30
Router(config-subif)#ip address 172.16.18.1 255.255.252.0
Router#
Router#wr